wsdl for Open Text Integration

<?xml version="1.0"?>
<wsdl:definitions
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:tns="http://services.ap.com/invoice"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:cordys="http://schemas.cordys.com/General/1.0/"
	name="AP_Webservices_WS"
	targetNamespace="http://services.ap.com/invoice">
	<wsdl:types>
		<xsd:schema
			xmlns:xsd="http://www.w3.org/2001/XMLSchema"
			xmlns:wcp="http://schemas.cordys.com/"
			xmlns=""
			attributeFormDefault="unqualified"
			elementFormDefault="qualified"
			targetNamespace="http://services.ap.com/invoice">
			<xsd:import
				namespace="http://schemas.cordys.com/General/1.0/"
				schemaLocation="http://ecmuatot.olamnet.com:8080/home/PTP/com.eibus.web.tools.wsdl.WSDLGateway.wcp?service=http://schemas.cordys.com/CordysSchemas//CordysFaultDetails.xsd&amp;organization=o=PTP,cn=cordys,cn=uatInst,o=olamdomain.com"
			/>
			<xsd:include
				schemaLocation="http://ecmuatot.olamnet.com:8080/home/PTP/com.eibus.web.tools.wsdl.WSDLGateway.wcp?service=http://schemas.cordys.com/WS-AppServer/1.0/WSAppServerSchema.xsd&amp;organization=o=PTP,cn=cordys,cn=uatInst,o=olamdomain.com"
			/>
			<xsd:element
				name="InvoiceDocumentDownloadWrapper">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element
							name="inputRequest"
							type="xsd:anyType"
						/>
					</xsd:sequence>
					<xsd:attributeGroup
						ref="tns:GetMethodAttributes"
					/>
				</xsd:complexType>
			</xsd:element>
			<xsd:element
				name="InvoiceDocumentDownloadWrapperResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element
							name="return"
							type="xsd:anyType"
						/>
					</xsd:sequence>
					<xsd:attributeGroup
						ref="tns:GetMethodAttributes"
					/>
				</xsd:complexType>
			</xsd:element>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message
		name="InvoiceDocumentDownloadWrapperInput">
		<wsdl:part
			name="body"
			element="tns:InvoiceDocumentDownloadWrapper"
		/>
	</wsdl:message>
	<wsdl:message
		name="InvoiceDocumentDownloadWrapperOutput">
		<wsdl:part
			name="body"
			element="tns:InvoiceDocumentDownloadWrapperResponse"
		/>
	</wsdl:message>
	<wsdl:message
		name="InvoiceDocumentDownloadWrapperFaultDetail">
		<wsdl:part
			name="FaultDetail"
			element="cordys:FaultDetails"
		/>
	</wsdl:message>
	<wsdl:portType
		name="AP_Webservices_WSI">
		<wsdl:operation
			name="InvoiceDocumentDownloadWrapper">
			<wsdl:input
				message="tns:InvoiceDocumentDownloadWrapperInput"
			/>
			<wsdl:output
				message="tns:InvoiceDocumentDownloadWrapperOutput"
			/>
			<wsdl:fault
				name="FaultDetail"
				message="tns:InvoiceDocumentDownloadWrapperFaultDetail"
			/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding
		name="AP_Webservices_WSI"
		type="tns:AP_Webservices_WSI">
		<soap:binding
			style="document"
			transport="http://schemas.xmlsoap.org/soap/http"
		/>
		<wsdl:operation
			name="InvoiceDocumentDownloadWrapper">
			<soap:operation
				soapAction=""
				style="document"
			/>
			<wsdl:input>
				<soap:body
					use="literal"
				/>
			</wsdl:input>
			<wsdl:output>
				<soap:body
					use="literal"
				/>
			</wsdl:output>
			<wsdl:fault
				name="FaultDetail">
				<soap:fault
					name="FaultDetail"
					use="literal"
				/>
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service
		name="AP_Webservices_WSIService">
		<wsdl:port
			name="AP_Webservices_WSI"
			binding="tns:AP_Webservices_WSI">
			<soap:address
				location="http://ecmuatot.olamnet.com:8080/home/PTP/com.eibus.web.soap.Gateway.wcp?organization=o=PTP,cn=cordys,cn=uatInst,o=olamdomain.com"
			/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
